/* ==================================================================   
 * Created [2006-12-29] by Jon.King 
 * ==================================================================  
 * TSS 
 * ================================================================== 
 * mailTo:jinpujun@hotmail.com
 * Copyright (c) Jon.King, 2012-2015 
 * ================================================================== 
 */

package com.jinhe.tss.cache;

/**
 * 缓存池Pool的自我清除功能接口。<br/>
 * 
 * Pool的实现类通过额外实现本接口来扩展使自己拥有自我清理（根据缓存对象的生命周期）的功能。
 */
public interface Cleaner {
	
	/**
	 * 创建清除线程。
	 */
	void initCleaner();
	
}
